### Edit DataFrame

* map function 
* Add new columns to DataFrame
* drop columns 
* update columns names

In [1]:
import pandas as pd

In [2]:
from pathlib import Path

In [3]:
fileName=Path('data/MFG10YearTerminationData.csv')

In [4]:
df= pd.read_csv(fileName,nrows=3,usecols=['city_name','length_of_service','gender_full'])

In [5]:
df

   length_of_service  city_name gender_full
0                 17  Vancouver        Male
1                 17     Mumbai      Female
2                 18     Sydney      Female

In [6]:
gender_short=df["gender_full"].map(lambda x: "M" if x == "Male" else "F")

In [7]:
gender_short

0    M
1    F
2    F
Name: gender_full, dtype: object

In [8]:
df["gender_short"] = gender_short

In [9]:
df

   length_of_service  city_name gender_full gender_short
0                 17  Vancouver        Male            M
1                 17     Mumbai      Female            F
2                 18     Sydney      Female            F

In [10]:
df = df.drop(columns=['gender_full'])

In [11]:
df

   length_of_service  city_name gender_short
0                 17  Vancouver            M
1                 17     Mumbai            F
2                 18     Sydney            F

In [12]:
df= df.rename(columns={"length_of_service": "length_of_service_in_years"})

In [13]:
df

   length_of_service_in_years  city_name gender_short
0                          17  Vancouver            M
1                          17     Mumbai            F
2                          18     Sydney            F

In [14]:
country=['US','IND','AUS']

In [129]:
df["country"] = country

In [130]:
df

   length_of_service_in_years  city_name gender_short country
0                          17  Vancouver            M      US
1                          17     Mumbai            F     IND
2                          18     Sydney            F     AUS